fix: proof react example
