--- a/react-example/swen90007-react-example-primer.md
+++ b/react-example/swen90007-react-example-primer.md
@@ -36,34 +36,31 @@ The following outlines the key technologies that comprise the stack. The stack i
 - Application Programming Interface (API) - deployed to the Tomcat webserver and built with JavaEE Servlets
 - Database - with PostgreSQL, an enterprise-grade, open source, Relational Database Management System (RDBMS)
 
-```mermaid
-flowchart
- 
- subgraph ui[UI]
-  direction LR
-  React
-  HTML
-  CSS
- end
+```plantuml
+@startuml System
+node "UI" {
+  [React]
+  [HTML]
+  [CSS]
+}
 
- subgraph api[API]
-  java[Java Servlet API]
-  Tomcat
-  JDBC
- end
+node "API" {
+  HTTP - [Tomcat]
+  [Java Servlet API]
+  [JDBC]
+}
 
- subgraph data[Database]
-  database[PostgreSQL]
- end
- 
- user --> ui 
- ui -->|HTTP\nJSON\nJWT| api 
- api -->|SQL| data
+database "PostgreSQL" {
+}
+
+[React] --> HTTP
+[JDBC] --> PostgreSQL 
+@enduml
 ```
 
 ### Primer structure
 
